# Contents
1. Imports
2. Checks
3. Merging
4. Exports

# 1. Imports

In [1]:
#Libraries
import pandas as pd
import numpy as np
import os

In [2]:
#Path
path = r'/Users/davidgriesel/Documents/0 - Analytics Projects/Online Grocery Store'

In [3]:
#Dataset 1
df_orders = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'cleaned_orders.pkl'))

In [4]:
#Dataset 2
df_orders_products = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'cleaned_orders_products.pkl'))

In [5]:
#Dataset 3
df_products = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'cleaned_products.pkl'))

In [6]:
#Dataset 4
df_customers = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'cleaned_customers.pkl'))

In [7]:
#Dataset 5
df_departments = pd.read_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'cleaned_departments.pkl'))

# 2. Checks

## 2.1. Orders

In [8]:
#Dimensions
df_orders.shape

(3421083, 7)

In [9]:
#Preview
df_orders.head()

,order_id,user_id,user_order_count,order_day_of_week,order_hour_of_day,days_since_last_order,is_first_order
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

##### Observations:
- Consistent with cleaned dataset

## 2.2. Orders Products

In [10]:
#Dimensions
df_orders_products.shape

(32434489, 4)

In [11]:
#Preview
df_orders_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

##### Observations:
- Consistent with cleaned dataset

## 2.3. Products

In [12]:
#Dimensions
df_products.shape

(49668, 5)

In [13]:
#Preview
df_products.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

##### Observations:
- Consistent with cleaned dataset

## 2.4. Customers

In [14]:
#Dimensions
df_customers.shape

(206209, 8)

In [15]:
#Preview
df_customers.head()

,user_id,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,26711,Female,Missouri,48,2017-01-01,3,married,165665
1,33890,Female,New Mexico,36,2017-01-01,0,single,59285
2,65803,Male,Idaho,35,2017-01-01,2,married,99568
3,125935,Female,Iowa,40,2017-01-01,0,single,42049
4,130797,Female,Maryland,26,2017-01-01,1,married,40374

##### Observations:
- Consistent with cleaned dataset

## 2.5. Departments

In [16]:
#Dimensions
df_departments.shape

(21, 2)

In [17]:
#Preview
df_departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

##### Observations:
- Consistent with cleaned dataset

# 3. Merging

## 3.1. Merge 1 (Orders & Orders Products)

In [18]:
#Merge using inner join on order_id with merge flag
df_merge_1 = df_orders.merge(df_orders_products, on = 'order_id', how = 'inner', indicator = True)

In [19]:
#Check merge rate
df_merge_1['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

In [20]:
#Confirm dimensions
df_merge_1.shape

(32434489, 11)

In [21]:
#Preview
df_merge_1.head()

,order_id,user_id,user_order_count,order_day_of_week,order_hour_of_day,days_since_last_order,is_first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [22]:
#Drop merge flag
df_merge_1 = df_merge_1.drop(columns = ['_merge'])

##### Observations:
- Successfully merged

## 3.2. Merge 2 (Merge 1 & Products)

In [23]:
#Merge using outer join on order_id with merge flag.
df_merge_2 = df_merge_1.merge(df_products, on = 'product_id', how = 'inner', indicator = True)

In [24]:
#Check merge rate
df_merge_2['_merge'].value_counts()

_merge
both          32403719
left_only            0
right_only           0
Name: count, dtype: int64

In [25]:
#Confirm dimensions
df_merge_2.shape

(32403719, 15)

In [26]:
#Preview
df_merge_2.head()

,order_id,user_id,user_order_count,order_day_of_week,order_hour_of_day,days_since_last_order,is_first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,Original Beef Jerky,23,19,4.4,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both

In [27]:
#Drop merge flag
df_merge_2 = df_merge_2.drop(columns = ['_merge'])

##### Observations:
- Successfully merged

## 3.3. Merge 3 (Merge 2 & Customers)

In [28]:
#Merge using outer join on order_id with merge flag.
df_merge_3 = df_merge_2.merge(df_customers, on = 'user_id', how = 'inner', indicator = True)

In [29]:
#Check merge rate
df_merge_3['_merge'].value_counts()

_merge
both          32403719
left_only            0
right_only           0
Name: count, dtype: int64

In [30]:
#Confirm dimensions
df_merge_3.shape

(32403719, 22)

In [31]:
#Preview
df_merge_3.head()

,order_id,user_id,user_order_count,order_day_of_week,order_hour_of_day,days_since_last_order,is_first_order,product_id,add_to_cart_order,reordered,...,department_id,prices,gender,state,age,date_joined,number_of_dependants,marital_status,income,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,...,7,9.0,Female,Alabama,31,2019-02-17,3,married,40423,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,16,12.5,Female,Alabama,31,2019-02-17,3,married,40423,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,19,4.4,Female,Alabama,31,2019-02-17,3,married,40423,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,19,4.7,Female,Alabama,31,2019-02-17,3,married,40423,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,17,1.0,Female,Alabama,31,2019-02-17,3,married,40423,both

In [32]:
#Drop merge flag
df_merge_3 = df_merge_3.drop(columns = ['_merge'])

##### Observations:
- Successfully merged

## 3.3. Merge 4 (Merge 3 & Departments)

In [33]:
#Merge using outer join on order_id with merge flag.
df_merge_4 = df_merge_3.merge(df_departments, on = 'department_id', how = 'inner', indicator = True)

In [34]:
#Check merge rate
df_merge_4['_merge'].value_counts()

_merge
both          32403719
left_only            0
right_only           0
Name: count, dtype: int64

In [35]:
#Confirm dimensions
df_merge_4.shape

(32403719, 23)

In [36]:
#Preview
df_merge_4.head()

,order_id,user_id,user_order_count,order_day_of_week,order_hour_of_day,days_since_last_order,is_first_order,product_id,add_to_cart_order,reordered,...,prices,gender,state,age,date_joined,number_of_dependants,marital_status,income,department,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,...,9.0,Female,Alabama,31,2019-02-17,3,married,40423,beverages,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,...,12.5,Female,Alabama,31,2019-02-17,3,married,40423,dairy eggs,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,...,4.4,Female,Alabama,31,2019-02-17,3,married,40423,snacks,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,...,4.7,Female,Alabama,31,2019-02-17,3,married,40423,snacks,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,...,1.0,Female,Alabama,31,2019-02-17,3,married,40423,household,both

In [37]:
#Drop merge flag
df_merge_4 = df_merge_4.drop(columns = ['_merge'])

##### Observations:
- Successfully merged

# 4. Exports

In [38]:
#Confirm dimensions
df_merge_4.shape

(32403719, 22)

In [39]:
#Export merged dataset
df_merge_4.to_pickle(os.path.join(path, '02 - Data', 'Prepared Data', 'merged_dataset.pkl'))